# 8월 1일 과제

## 황 성 윤

## 1. 투수들의 기록중에서 평균자책점(ERA), 투구인닝(IP), 탈삼진(SO) 기록을 찾아서 Pitcher_stats 란 테이블을 만들고, Eagles 테이블과 Join 하여 백넘버, 선수명, 포지션, 투구인닝, 평균자책점, 탈삼진 필드를 갖는 데이터 프레임을 만들어서 Join 한 결과를 입력하고, 그 결과를 보이시오.

In [1]:
import sqlite3

### 1.1 데이터베이스 접속

In [2]:
conn = sqlite3.connect('./test.db') # 파일 DB 접속

### 1.2 테이블 생성

In [3]:
cur = conn.cursor()
# Eagles table
cur.execute('CREATE TABLE IF NOT EXISTS Eagles \
    (back_no INT NOT NULL, \
     name TEXT, \
     position TEXT, \
     hands TEXT, \
     highschool TEXT, \
     height INT, \
     PRIMARY KEY(back_no));')

### 1.3 데이터 삽입 및 처리

In [4]:
# 기본 스트링 쿼리
cur = conn.cursor()
cur.execute("INSERT INTO Eagles('back_no', 'name', 'position') VALUES (30, '호잉', '외야수');") 
conn.commit() # 변경사항 저장

In [5]:
cur = conn.cursor()
# all 이면 생략
cur.execute("INSERT INTO Eagles VALUES \
            (1, '하주석', '내야수', '우투좌타', '신일고', 184), \
            (9, '이동훈', '외야수', '좌투좌타', '상원고', 178); ")
conn.commit()

In [3]:
import numpy as np
import pandas as pd

In [6]:
# 파일에서 읽어서 데이터베이스에 쓰기
players = pd.read_csv('.\players.csv', encoding='EUC-KR')
players

   back_no name position hands highschool  height
0       17  김범수       투수  좌투좌타      천안북일고     181
1       38  안영명       투수  우투우타      천안북일고     183
2       36  장민재       투수  우투우타      광주제일고     184
3       13  최재훈       포수  우투우타        덕수고     178
4       52  김태균      내야수  우투우타      천안북일고     185
5        6  오선진      내야수  우투우타        성남고     179
6       66  유장혁      외야수  우투우타      광주제일고     186
7      108  김관호       포수  우투우타        야탑고     179
8       65  김진욱       투수  우투우타        유신고     176
9       43  정은원      내야수  우투좌타        인천고     177

In [7]:
cur = conn.cursor()
sql = 'INSERT INTO Eagles VALUES (?, ?, ?, ?, ?, ?);'
for i in range(10):
    cur.execute(sql, (int(players.iloc[i,0]), 
                      players.iloc[i,1], players.iloc[i,2],
                      players.iloc[i,3], players.iloc[i,4], 
                      int(players.iloc[i,5])))
conn.commit()

In [8]:
cur = conn.cursor()
cur.execute("UPDATE Eagles SET hands='우투좌타', highschool='미상', height=190 \
             WHERE back_no=30;")
conn.commit()

In [9]:
# 순회 조회
cur = conn.cursor()
cur.execute('SELECT * FROM Eagles')
for row in cur:
    print(row)  # tuple

(30, '호잉', '외야수', '우투좌타', '미상', 190)
(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(9, '이동훈', '외야수', '좌투좌타', '상원고', 178)
(17, '김범수', '투수', '좌투좌타', '천안북일고', 181)
(38, '안영명', '투수', '우투우타', '천안북일고', 183)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)
(13, '최재훈', '포수', '우투우타', '덕수고', 178)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(6, '오선진', '내야수', '우투우타', '성남고', 179)
(66, '유장혁', '외야수', '우투우타', '광주제일고', 186)
(108, '김관호', '포수', '우투우타', '야탑고', 179)
(65, '김진욱', '투수', '우투우타', '유신고', 176)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)

### 1.4 Join을 위한 준비

In [10]:
cur = conn.cursor()
# Pitcher_stats table
cur.execute('CREATE TABLE IF NOT EXISTS Pitcher_stats \
    (id INT NOT NULL, \
     player TEXT, \
     era REAL, \
     ip REAL, \
     so INT, \
     PRIMARY KEY(id));')

In [15]:
throw = pd.read_csv('.\stats1.csv', encoding='EUC-KR')
throw

  player   era   ip  so
0    김범수  5.67   81  65
1    안영명  3.43   44  35
2    장민재  4.81   91  84
3    김진욱  0.00    1   0
4    유희관  3.29  112  45
5    이영하  3.53  109  60
6    박진우  3.93  107  66
7     김민  4.63  118  67
8    백정현  4.80  105  56
9    차우찬  4.93  115  90

In [16]:
cur = conn.cursor()
sql = 'INSERT INTO Pitcher_stats VALUES (?, ?, ?, ?, ?);'
for i in range(10):
    cur.execute(sql, (i+1, throw.iloc[i,0], 
                      float(throw.iloc[i,1]),
                      int(throw.iloc[i,2]), 
                      int(throw.iloc[i,3])))
conn.commit()

In [17]:
cur = conn.cursor()
cur.execute('SELECT * FROM Pitcher_stats')
for row in cur:
    print(row)

(1, '김범수', 5.67, 81.0, 65)
(2, '안영명', 3.43, 44.0, 35)
(3, '장민재', 4.81, 91.0, 84)
(4, '김진욱', 0.0, 1.0, 0)
(5, '유희관', 3.29, 112.0, 45)
(6, '이영하', 3.53, 109.0, 60)
(7, '박진우', 3.93, 107.0, 66)
(8, '김민', 4.63, 118.0, 67)
(9, '백정현', 4.8, 105.0, 56)
(10, '차우찬', 4.93, 115.0, 90)

### 1.5 Join

In [30]:
sql = "SELECT e.back_no, e.name, e.position, \
              p.era, p.ip, p.so \
              FROM Eagles AS e JOIN Pitcher_stats AS p \
              ON e.name LIKE p.player;"
cur = conn.cursor()
cur.execute(sql) 
rows = cur.fetchall();
columnName = ['등번호','선수명','포지션','평균자책점','투구인닝','탈삼진']
eagles_df = pd.DataFrame(columns = columnName)
for row in rows:
    eagles_df = eagles_df.append(pd.DataFrame(pd.DataFrame([list(row)], columns = columnName)), ignore_index = True)

In [31]:
eagles_df

  등번호  선수명 포지션  평균자책점  투구인닝 탈삼진
0  17  김범수  투수   5.67  81.0  65
1  38  안영명  투수   3.43  44.0  35
2  36  장민재  투수   4.81  91.0  84
3  65  김진욱  투수   0.00   1.0   0

## 2. 다음의 지시대로 DB 테이블을 만들고 이를 조회하는 프로그램을 만드시오.

- 국내의 대표적인 걸그룹 또는 보이그룹 5개 이상에 대하여 다음과 같은 정보를 갖는 테이블을 만드시오. (*는 Primary Key)
    - id(*), group_name, 구성원 수, 데뷔일자, 소속사

- 이들이 불렀던 노래 또는 다른 사람이 불렀던 노래 10곡 이상에 대하여 다음의 정보를 갖는 테이블을 만드시오.
    - song_id(*), song_name, 그룹 id, 발표년도, 작곡가, 도입부 가사

- 위 두개의 테이블을 join한 결과를 가지고 다음의 필드를 갖는 데이터 프레임을 만드시오.
    - 그룹 이름, 구성원 수, 데뷔 일자, 노래 이름, 발표 년도

In [32]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Girl1 \
    (id INT NOT NULL, \
     group_name TEXT, \
     members INT, \
     debut TEXT, \
     company TEXT, \
     PRIMARY KEY(id));')

In [33]:
girl1 = pd.read_csv('.\girl1.csv', encoding='EUC-KR')
girl1

   id group_name  members  debut     company
0   1       소녀시대        8  2007년    SM엔터테인먼트
1   2       레드벨벳        5  2014년    SM엔터테인먼트
2   3       여자친구        6  2015년        쏘스뮤직
3   4       우주소녀       13  2016년   스타쉽엔터테인먼트
4   5       EXID        5  2012년       바나나컬쳐
5   6       에이핑크        6  2011년  플레이엠엔터테인먼트
6   7       오마이걸        7  2015년    WM엔터테인먼트
7   8        구구단        8  2016년  젤리피쉬엔터테인먼트

In [34]:
cur = conn.cursor()
sql = 'INSERT INTO Girl1 VALUES (?, ?, ?, ?, ?);'
for i in range(8):
    cur.execute(sql, (int(girl1.iloc[i,0]), 
                      girl1.iloc[i,1],
                      int(girl1.iloc[i,2]), 
                      girl1.iloc[i,3],
                      girl1.iloc[i,4]))
conn.commit()

In [35]:
cur = conn.cursor()
cur.execute('SELECT * FROM Girl1')
for row in cur:
    print(row)

(1, '소녀시대', 8, '2007년', 'SM엔터테인먼트')
(2, '레드벨벳', 5, '2014년', 'SM엔터테인먼트')
(3, '여자친구', 6, '2015년', '쏘스뮤직')
(4, '우주소녀', 13, '2016년', '스타쉽엔터테인먼트')
(5, 'EXID', 5, '2012년', '바나나컬쳐')
(6, '에이핑크', 6, '2011년', '플레이엠엔터테인먼트')
(7, '오마이걸', 7, '2015년', 'WM엔터테인먼트')
(8, '구구단', 8, '2016년', '젤리피쉬엔터테인먼트')

In [36]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Girl2 \
    (song_id INT NOT NULL, \
     song_name TEXT, \
     group_id INT, \
     year TEXT, \
     writer TEXT, \
     sentence TEXT, \
     PRIMARY KEY(song_id));')

In [37]:
girl2 = pd.read_csv('.\girl2.csv', encoding='EUC-KR')
girl2

,song_id,song_name,group_id,year,writer,sentence
0,1,다시 만난 세계,1,2007년,켄지,전해주고 싶어 슬픈 시간이
1,2,Gee,1,2009년,이트라이브,너무 너무 멋져 눈이 눈이 부셔
2,3,Rookie,2,2017년,Sara Forsberg,당당히 넌 고개를 들고 나를 봐 역시
3,4,덤덤덤,2,2015년,LDN Noise,너땜에 하루 종일 고민하지만
4,5,오늘부터 우리는,3,2015년,이기,널 향한 설레임을 오늘부터 우리는
5,6,여름비,3,2017년,이기,찬란하게 빛나던 시간이었다고
6,7,비밀이야,4,2016년,신사동호랭이,밤새 뒤척 뒤척이다가 나 괜히 맘이 그래
7,8,La La Love,4,2019년,영광의 얼굴들,반짝 불빛이 반짝
8,9,위아래,5,2015년,신사동호랭이,위 아래 위 위 아래
9,10,아슬해,5,2015년,신사동호랭이,아슬아슬해 아슬아슬해 아슬아슬해
10,11,Hush,6,2012년,라도,자꾸 생각나 너무 떨리고
11,12,NoNoNo,6,2013년,신사동호랭이,슬퍼하지마 nonono
12,13,내 얘길 들어봐,7,2019년,황세준,한번 두번 세번 네번 말해도
13,14,불꽃놀이,7,2019년,이원민,날 바라보던 너의 눈에 비친
14,15,The Boots,8,2018년,이재광,두 발에 빛난 My Boots
15,16,Chococo,8,2019년,김도훈,달콤한 내 입술 초콜릿 맛

In [38]:
cur = conn.cursor()
sql = 'INSERT INTO Girl2 VALUES (?, ?, ?, ?, ?, ?);'
for i in range(16):
    cur.execute(sql, (int(girl2.iloc[i,0]), 
                      girl2.iloc[i,1],
                      int(girl2.iloc[i,2]), 
                      girl2.iloc[i,3],
                      girl2.iloc[i,4],
                      girl2.iloc[i,5]))
conn.commit()

In [39]:
cur = conn.cursor()
cur.execute('SELECT * FROM Girl2')
for row in cur:
    print(row)

(1, '다시 만난 세계', 1, '2007년', '켄지', '전해주고 싶어 슬픈 시간이')
(2, 'Gee', 1, '2009년', '이트라이브', '너무 너무 멋져 눈이 눈이 부셔 ')
(3, 'Rookie', 2, '2017년', 'Sara Forsberg', '당당히 넌 고개를 들고 나를 봐 역시')
(4, '덤덤덤', 2, '2015년', 'LDN Noise', '너땜에 하루 종일 고민하지만')
(5, '오늘부터 우리는', 3, '2015년', '이기', '널 향한 설레임을 오늘부터 우리는')
(6, '여름비', 3, '2017년', '이기', '찬란하게 빛나던 시간이었다고')
(7, '비밀이야', 4, '2016년', '신사동호랭이', '밤새 뒤척 뒤척이다가 나 괜히 맘이 그래')
(8, 'La La Love', 4, '2019년', '영광의 얼굴들', '반짝 불빛이 반짝')
(9, '위아래', 5, '2015년', '신사동호랭이', '위 아래 위 위 아래')
(10, '아슬해', 5, '2015년', '신사동호랭이', '아슬아슬해 아슬아슬해 아슬아슬해')
(11, 'Hush', 6, '2012년', '라도', '자꾸 생각나 너무 떨리고')
(12, 'NoNoNo', 6, '2013년', '신사동호랭이', '슬퍼하지마 nonono')
(13, '내 얘길 들어봐', 7, '2019년', '황세준', '한번 두번 세번 네번 말해도')
(14, '불꽃놀이', 7, '2019년', '이원민', '날 바라보던 너의 눈에 비친')
(15, 'The Boots', 8, '2018년', '이재광', '두 발에 빛난 My Boots')
(16, 'Chococo', 8, '2019년', '김도훈', '달콤한 내 입술 초콜릿 맛')

In [40]:
sql = "SELECT g1.group_name, g1.members, g1.debut, \
              g2.song_name, g2.year \
              FROM Girl1 AS g1 JOIN Girl2 AS g2 \
              ON g1.id LIKE g2.group_id;"
cur = conn.cursor()
cur.execute(sql) 
rows = cur.fetchall();
columnName = ['그룹 이름','구성원 수','데뷔 일자','노래 이름','발표년도']
girls_df = pd.DataFrame(columns = columnName)
for row in rows:
    girls_df = girls_df.append(pd.DataFrame(pd.DataFrame([list(row)], columns = columnName)), ignore_index = True)

In [41]:
girls_df

   그룹 이름 구성원 수  데뷔 일자       노래 이름   발표년도
0   소녀시대     8  2007년    다시 만난 세계  2007년
1   소녀시대     8  2007년         Gee  2009년
2   레드벨벳     5  2014년      Rookie  2017년
3   레드벨벳     5  2014년         덤덤덤  2015년
4   여자친구     6  2015년    오늘부터 우리는  2015년
5   여자친구     6  2015년         여름비  2017년
6   우주소녀    13  2016년        비밀이야  2016년
7   우주소녀    13  2016년  La La Love  2019년
8   EXID     5  2012년         위아래  2015년
9   EXID     5  2012년         아슬해  2015년
10  에이핑크     6  2011년        Hush  2012년
11  에이핑크     6  2011년      NoNoNo  2013년
12  오마이걸     7  2015년    내 얘길 들어봐  2019년
13  오마이걸     7  2015년        불꽃놀이  2019년
14   구구단     8  2016년   The Boots  2018년
15   구구단     8  2016년     Chococo  2019년

## 3. 사용자의 이름과, 비밀번호를 갖는 Users 테이블이 있다. 사용자의 이름과 비밀번호를 올바르게 입력하면 ‘성공’을 출력하고, 잘못 입력하면 ‘실패’를 출력하는 프로그램을 작성하시오.

In [4]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Users \
    (id INT NOT NULL, \
     name TEXT, \
     password TEXT, \
     PRIMARY KEY(id));')

In [7]:
word = pd.read_csv('.\word.csv', encoding='EUC-KR')
word

   id name      password
0   1  박수현      park23$%
1   2  김태희       kim^&23
2   3  김민우    minwoo45^&
3   4  이이슬      rain67%^
4   5  강민석     river45&*
5   6  김예슬    yeseul56$&
6   7  이나영  nayoung654&*
7   8  임동진     east345^&
8   9  김혜진   hyejin432%^
9  10  최성훈      choi54^#

In [10]:
cur = conn.cursor()
sql = 'INSERT INTO Users VALUES (?, ?, ?);'
for i in range(10):
    cur.execute(sql, (int(word.iloc[i,0]), word.iloc[i,1], word.iloc[i,2]))
conn.commit()

IntegrityError: UNIQUE constraint failed: Users.id

In [53]:
cur = conn.cursor()
cur.execute('SELECT * FROM Users')
columnName = ['id','이름','비밀번호']
users_df = pd.DataFrame(columns = columnName)
for row in rows:
    users_df = users_df.append(pd.DataFrame(pd.DataFrame([list(row)], columns = columnName)), ignore_index = True)

AssertionError: 3 columns passed, passed data had 5 columns

In [54]:
cur.execute('DROP TABLE Users')